SH1_vct0.2_v50mps/system/controlDict
FoamFile
{
    version     3.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     sonicFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.0;

deltaT          0.001;

writeControl    runTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression    off;

timeFormat      general;

timePrecision   6;

runTimeModifiable   true;

functions
{
    rhofunc
    {
        type                writeRegisteredObject;
        functionObjectLibs  ("libIOFunctionObjects.so");
        outputControl       outputTime;
        outputInterval      1;
        objectNames
        (
            "rho"
        );
    }
}

